# Obtén y conoce tus datos



### 1. Importa las librerías necesarias

In [2]:
import numpy as np
import pandas as pd

### 2. Importa el dataset de este [enlace](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) y guárdalo en una variable llamada users. Usa pd.read_csv()

In [3]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|")

users.info()
users.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### 3. Muestra las 25 primeros registros

In [6]:
users.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### 4. Muestra las 25 primeros registros de otra forma

In [16]:
users[:5]

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [13]:
users.iloc[:5]

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [15]:
users.loc[:4]

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### 5. Muestra los últimos 25 registros

In [18]:
users.tail(5)

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [22]:
users[-5:]

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [24]:
users.iloc[-5:]

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [34]:
users.loc[len(users)-5:]

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### 6. Cuántos registros hay en total en este dataset?
Resuélvelo de al menos dos formas diferentes

In [39]:
len(users)

943

In [56]:
users.shape[0]

943

In [41]:
users.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [42]:
users.count()

user_id       943
age           943
gender        943
occupation    943
zip_code      943
dtype: int64

In [52]:
users.user_id.max()

np.int64(943)

### 7. Cuántas columnas hay en total en este dataset?
Resuélvelo de al menos dos formas diferentes

In [53]:
print(len(users.columns))

5

In [59]:
users.shape[1]

5

In [58]:
len(users.values[0])

5

In [64]:
len(users.T)

5

### 8. Haz un print de cada uno de los nombres de las columnas

In [60]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [74]:
for i in users.columns:
    print(i)

user_id
age
gender
occupation
zip_code

In [75]:
print(*users.columns, sep='\n')

user_id
age
gender
occupation
zip_code

In [84]:
print(', '.join(users.columns))

user_id, age, gender, occupation, zip_code

### 9. Accede al índice, a los nombres de las columnas y a los valores por separado

In [92]:
users.index

RangeIndex(start=0, stop=943, step=1)

In [78]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [79]:
users.values

array([[1, 24, 'M', 'technician', '85711'],
       [2, 53, 'F', 'other', '94043'],
       [3, 23, 'M', 'writer', '32067'],
       ...,
       [941, 20, 'M', 'student', '97229'],
       [942, 48, 'F', 'librarian', '78209'],
       [943, 22, 'M', 'student', '77841']], shape=(943, 5), dtype=object)

### 10. Cuál es el tipo de cada columna del dataset?
Hazlo de dos formas diferentes

In [101]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [97]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [108]:
# COLUMNS ES UN ÍNDICE (UNA LISTA DE ELEMENTOS) QUE CONTIENE EL NOMBRE DE LAS COLUMNAS
for i in users.columns:
    print(type(i))

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [94]:
for i in users.iloc[0]:
    print(type(i))

<class 'numpy.int64'>
<class 'numpy.int64'>
<class 'str'>
<class 'str'>
<class 'str'>

### 11. Haz un print solo de la columna de occupation
Hazlo de dos formas diferentes

In [112]:
print(users['occupation'])

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [113]:
print(users.occupation)

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [123]:
users.loc[:, 'occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### 12. ¿Cuántas profesiones diferentes hay? ¿Y personas por profesión?

In [129]:
len(users['occupation'].unique())

21

In [132]:
users['occupation'].nunique()

21

In [130]:
users['occupation'].value_counts()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

### 13. ¿Cuál es la profesión más común?

In [144]:
print(users['occupation'].value_counts().idxmax())

student

In [150]:
users['occupation'].describe().top

'student'

In [156]:
users['occupation'].describe()['top']

'student'

In [172]:
users['occupation'].value_counts().nlargest().index[0]

'student'

### 14. Obtén un resumen de las principales medidas estadísticas de las variables numéricas.  Usa describe()

In [173]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### 15. Obtén un resumen de las principales medidas estadísticas de todas las variables.  Usa describe()

In [174]:
users.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### 16. Obtén un resumen de las principales medidas estadísticas de solo la columna occupation.  Usa describe()

In [175]:
users['occupation'].describe(include='all')

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 17. ¿Cuál es la edad media?

In [176]:
users['age'].mean()
#users['age'].sum() / users['age'].count()

np.float64(34.05196182396607)

### 18. ¿Cuál es la edad menos frecuente?

In [178]:
# inicializo la Sserie de Pandas para el calculo de la frecuencia de cada edad
frecuencia = pd.Series([])
#print('\n',frecuencia, type(frecuencia), '\n', '◇'*20,'\n')

# obtengo una Serie de Pandas desde las edades del Dataframe Users y su frecuencia
frecuencia = users['age'].value_counts()
#print('\n',frecuencia, type(frecuencia), '\n','◇'*20,'\n')

# hago un reset_index para convertirlo en un Dataframe
frecuencia = users['age'].value_counts().reset_index()
#print('\n',frecuencia, type(frecuencia), '\n','◇'*20,'\n')

# Renombro las columnas
frecuencia.columns = ['age', 'count']
#print('\n',frecuencia, type(frecuencia), '\n','◇'*20,'\n')

# calculo cuántas veces ocurre la edad menos frecuente
# sólo devuelve la primera de las edades menos frecuentes
ocurrencia_minima = frecuencia['count'].min()
print('\n',"Ocurrencia menos frecuente:", ocurrencia_minima)

# utilizo una máscara para guardar en otro dataframe sólo las edades que tienen un count igual a la ocurrencia menos frecuente
edades_menos_frecuentes = frecuencia[frecuencia['count'] == ocurrencia_minima]
print('\n',"Edades menos frecuentes:", '\n', edades_menos_frecuentes)

 Ocurrencia menos frecuente: 1

 Edades menos frecuentes:
     age  count
56    7      1
57   11      1
58   66      1
59   10      1
60   73      1